### SQL QUERIES USING MYSQL-PYTHON CONNECTION STRING

#### BY EDEH EMEKA N

In [ ]:
!pip install mysql-connector

In [2]:
import mysql.connector

In [3]:
import pandas as pd #Because i need my query results in dataframe format

In [4]:
#connecting to mysql database

mydb = mysql.connector.connect(host = 'localhost', username = 'root', passwd = 'use your password', database = 'justice')
mydb

In [5]:
#confirming that the above connection was successful

if(mydb):
    print("connection successfull")
else:
    print('connection unsuccesful')

connection successfull

In [6]:
cursor = mydb.cursor()

In [14]:
#cursor.execute("Create database ORG") will create a new database called "ORG". I won't be working with this database though.
# As shown on my connection string above, I already connected to "justice" database which contains the tables i will be working with

In [7]:
cursor.execute("Show tables") #This will show the tables in the "justice" database i connected to.

In [8]:
for tb in cursor:
    print(tb)

('avocado',)
('bonus',)
('country_summary',)
('employee',)
('international_education',)
('london_crimes',)
('movie_data',)
('nyc_bike_sharing',)
('orders',)
('products',)
('title',)
('warehouse',)
('worker',)

In [9]:
#Alternatively, i can view the tables in my justice database by running the query below. 

tables = pd.read_sql("Show tables;", con=mydb)
tables

          Tables_in_justice
0                   avocado
1                     bonus
2           country_summary
3                  employee
4   international_education
5             london_crimes
6                movie_data
7          nyc_bike_sharing
8                    orders
9                  products
10                    title
11                warehouse
12                   worker

In [88]:
#I will be working with "bonus", "worker", and "title" tables. Let's first view the content of these tables one after the other
# using two methods each before answering the needed questions.

In [10]:
#First method for printing the bonus table
cursor.execute("select * from justice.bonus")
result = cursor.fetchall() #this will display the last executed statement
for row in result:
    print(row)

(1, 5000, datetime.datetime(2016, 2, 20, 0, 0))
(2, 3000, datetime.datetime(2016, 6, 11, 0, 0))
(3, 4000, datetime.datetime(2016, 2, 20, 0, 0))
(1, 4500, datetime.datetime(2016, 2, 20, 0, 0))
(2, 3500, datetime.datetime(2016, 6, 11, 0, 0))

In [11]:
#The second method prints the result as a dataframe.

bonus_table = pd.read_sql("select * from bonus;", con=mydb)
bonus_table

   WORKER_REF_ID  BONUS_AMOUNT BONUS_DATE
0              1          5000 2016-02-20
1              2          3000 2016-06-11
2              3          4000 2016-02-20
3              1          4500 2016-02-20
4              2          3500 2016-06-11

In [12]:
#First method for the worker table

cursor.execute("select * from justice.worker")
result = cursor.fetchall()

for row in result:
    print(row)

(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(2, 'Niharika', 'Verma', 80000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR')
(4, 'Amitabh', 'Singh', 500000, datetime.datetime(2014, 2, 20, 9, 0), 'Admin')
(5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin')
(6, 'Vipul', 'Diwan', 200000, datetime.datetime(2014, 6, 11, 9, 0), 'Account')
(7, 'Satish', 'Kumar', 75000, datetime.datetime(2014, 1, 20, 9, 0), 'Account')
(8, 'Geetika', 'Chauhan', 90000, datetime.datetime(2014, 4, 11, 9, 0), 'Admin')

In [13]:
#second method for worker table

worker_table = pd.read_sql("select * from worker;", con=mydb)
worker_table

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
7          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

In [14]:
#first method for title table

cursor.execute("select * from justice.title")
result = cursor.fetchall()

for row in result:
    print(row)

(1, 'Manager', datetime.datetime(2016, 2, 20, 0, 0))
(2, 'Executive', datetime.datetime(2016, 6, 11, 0, 0))
(8, 'Executive', datetime.datetime(2016, 6, 11, 0, 0))
(5, 'Manager', datetime.datetime(2016, 6, 11, 0, 0))
(4, 'Asst. Manager', datetime.datetime(2016, 6, 11, 0, 0))
(7, 'Executive', datetime.datetime(2016, 6, 11, 0, 0))
(6, 'Lead', datetime.datetime(2016, 6, 11, 0, 0))
(3, 'Lead', datetime.datetime(2016, 6, 11, 0, 0))

In [15]:
#second method for title table.

title_table = pd.read_sql("select * from title;", con=mydb)
title_table

   WORKER_REF_ID   WORKER_TITLE AFFECTED_FROM
0              1        Manager    2016-02-20
1              2      Executive    2016-06-11
2              8      Executive    2016-06-11
3              5        Manager    2016-06-11
4              4  Asst. Manager    2016-06-11
5              7      Executive    2016-06-11
6              6           Lead    2016-06-11
7              3           Lead    2016-06-11

##### Going forword, i will be querying the tables using the second method because i want the outputs displayed in dataframe

##### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>.

In [16]:
Ans1 = pd.read_sql("select FIRST_NAME as FN from worker;", con=mydb)
Ans1

         FN
0    Monika
1  Niharika
2    Vishal
3   Amitabh
4     Vivek
5     Vipul
6    Satish
7   Geetika

##### Q-2. Write an SQL query to fetch “FIRST_NAME” from Worker table in upper case.

In [17]:
Ans2 = pd.read_sql("select upper(FIRST_NAME) from worker;", con=mydb)
Ans2

  upper(FIRST_NAME)
0            MONIKA
1          NIHARIKA
2            VISHAL
3           AMITABH
4             VIVEK
5             VIPUL
6            SATISH
7           GEETIKA

##### Q-3. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [102]:
Ans3 = pd.read_sql("select distinct(DEPARTMENT) from worker;", con=mydb)
Ans3

  DEPARTMENT
0         HR
1      Admin
2    Account

##### Q-4. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [103]:
Ans4 = pd.read_sql("Select substring(FIRST_NAME,1,3) from Worker;", con=mydb)
Ans4

  substring(FIRST_NAME,1,3)
0                       Mon
1                       Nih
2                       Vis
3                       Ami
4                       Viv
5                       Vip
6                       Sat
7                       Gee

##### Q-5. Write an SQL query to find the position of the alphabet (‘A’) in the first name column ‘Amitabh’ from Worker table.

In [105]:
Ans5 = pd.read_sql("Select INSTR(FIRST_NAME, BINARY'A') from Worker where FIRST_NAME = 'Amitabh';", con=mydb)
Ans5

   INSTR(FIRST_NAME, BINARY'A')
0                             1

##### Q-6. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [106]:
Ans6 = pd.read_sql("Select RTRIM(FIRST_NAME) from Worker;", con=mydb)
Ans6

  RTRIM(FIRST_NAME)
0            Monika
1          Niharika
2            Vishal
3           Amitabh
4             Vivek
5             Vipul
6            Satish
7           Geetika

##### Q-7. Write an SQL query to print the DEPARTMENT from Worker table after removing white spaces from the left side.

In [107]:
Ans7 = pd.read_sql("Select LTRIM(DEPARTMENT) from Worker;", con=mydb)
Ans7

  LTRIM(DEPARTMENT)
0                HR
1             Admin
2                HR
3             Admin
4             Admin
5           Account
6           Account
7             Admin

##### Q-8. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [111]:
Ans8 = pd.read_sql("Select distinct length(DEPARTMENT) from Worker;", con=mydb)
Ans8

   length(DEPARTMENT)
0                   2
1                   5
2                   7

##### Q-9. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

In [112]:
Ans9 = pd.read_sql("Select REPLACE(FIRST_NAME,'a','A') from Worker;", con=mydb)
Ans9

  REPLACE(FIRST_NAME,'a','A')
0                      MonikA
1                    NihArikA
2                      VishAl
3                     AmitAbh
4                       Vivek
5                       Vipul
6                      SAtish
7                     GeetikA

##### Q-10. Write an SQL query to print the FIRST_NAME and LAST_NAME from Worker table into a single column COMPLETE_NAME. A space char should separate them.

In [161]:
Ans10 = pd.read_sql("Select concat(FIRST_NAME,' ', LAST_NAME) as COMPLETE_NAME from Worker;", con=mydb)
Ans10

     COMPLETE_NAME
0     Monika Arora
1   Niharika Verma
2   Vishal Singhal
3    Amitabh Singh
4      Vivek Bhati
5      Vipul Diwan
6     Satish Kumar
7  Geetika Chauhan

##### Q-11. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending.

In [117]:
Ans11 = pd.read_sql("Select * from Worker order by FIRST_NAME ;", con=mydb)
Ans11 # "order by" statement is in an ascending format by default

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
3          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
7          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

##### Q-12. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

In [118]:
Ans12 = pd.read_sql("Select * from Worker order by FIRST_NAME asc, DEPARTMENT desc;", con=mydb)
Ans12

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
2          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
3          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
6          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
7          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

##### Q-13. Write an SQL query to print details for Workers with the first name as “Vipul” and “Satish” from Worker table.

In [126]:
Ans13 = pd.read_sql("Select * from Worker where FIRST_NAME in ('Vipul' , 'Satish');", con=mydb)
Ans13

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
1          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account

##### Q-14. Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

In [129]:
Ans14 = pd.read_sql("Select * from Worker where FIRST_NAME not in ('Vipul' , 'Satish');", con=mydb)
Ans14

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
5          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

##### Q-15. Write an SQL query to print details of Workers with DEPARTMENT name as “Admin”.

In [130]:
Ans15 = pd.read_sql("Select * from Worker where DEPARTMENT = 'ADMIN';", con=mydb)
Ans15

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
1          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
2          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
3          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

##### Q-16. Write an SQL query to print details of the Workers whose FIRST_NAME contains ‘a’.

In [18]:
Ans16 = pd.read_sql("Select * from Worker where FIRST_NAME like '%a%';", con=mydb)
Ans16

#'%a%' means position 'a' can be anywhere in the word

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account
5          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

##### Q-17. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘a’.

In [133]:
Ans17 = pd.read_sql("Select * from Worker where FIRST_NAME like '%a';", con=mydb)
Ans17

#'%a' means charaacters before the 'a' which comes last

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin

##### Q-18. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

In [136]:
Ans18 = pd.read_sql("Select * from Worker where FIRST_NAME like '_____h';", con=mydb)
Ans18
#five underscores and an 'h' to complete six characters/alphabets

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account

##### Q-19. Write an SQL query to print details of the Workers whose SALARY lies between 100000 and 500000.

In [140]:
Ans19 = pd.read_sql("Select * from Worker where SALARY between 100000 and 500000;", con=mydb)
Ans19

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
3          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
4          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account

##### Q-20. Write an SQL query to print details of the Workers who have joined in Feb’2014.

In [144]:
Ans20 = pd.read_sql("Select * from Worker where JOINING_DATE like '2014-02%';", con=mydb)
Ans20

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin

In [148]:
# Alternatively, we can achieve the same result by running the query below. 
a = pd.read_sql("Select * from Worker where year(JOINING_DATE) = 2014 and month(JOINING_DATE) = 2;", con=mydb)
a

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin

##### Q-21. Write an SQL query to fetch the count of employees working in the department ‘Admin’.

In [150]:
Ans21 = pd.read_sql("Select count(*) from Worker where DEPARTMENT = 'Admin';", con=mydb)
Ans21

   count(*)
0         4

##### Q-22. Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000.

In [154]:
Ans22 = pd.read_sql("Select concat(FIRST_NAME, ' ', LAST_NAME) as worker_names, SALARY from worker where SALARY between 50000 and 100000;", con=mydb)
Ans22

      worker_names  SALARY
0     Monika Arora  100000
1   Niharika Verma   80000
2     Satish Kumar   75000
3  Geetika Chauhan   90000

In [156]:
#Alternatively, same result can be achieved by applying sub-query in the WHERE clause
pd.read_sql("SELECT CONCAT(FIRST_NAME, ' ', LAST_NAME) As Worker_Name, Salary FROM worker WHERE WORKER_ID IN (SELECT WORKER_ID FROM worker WHERE Salary BETWEEN 50000 AND 100000);", con=mydb)

       Worker_Name  Salary
0     Monika Arora  100000
1   Niharika Verma   80000
2     Satish Kumar   75000
3  Geetika Chauhan   90000

##### Q-23. Write an SQL query to fetch the no. of workers for each department in the descending order.

In [170]:
Ans23 = pd.read_sql("Select DEPARTMENT, count(*) as no_of_workers from Worker group by DEPARTMENT order by no_of_workers desc ;", con=mydb)
Ans23

  DEPARTMENT  no_of_workers
0      Admin              4
1         HR              2
2    Account              2

##### Q-24. Write an SQL query to print details of the Workers who are also Managers.

In [172]:
Ans24 = pd.read_sql("Select concat(worker.FIRST_NAME, ' ', worker.LAST_NAME) as NAME, title.WORKER_TITLE from worker inner join title on worker.WORKER_ID = title.WORKER_REF_ID where title.WORKER_TITLE = 'Manager';", con=mydb)
Ans24

           NAME WORKER_TITLE
0  Monika Arora      Manager
1   Vivek Bhati      Manager

In [171]:
#Alternatively...
s = pd.read_sql("SELECT DISTINCT W.FIRST_NAME, T.WORKER_TITLE FROM Worker W INNER JOIN Title T ON W.WORKER_ID = T.WORKER_REF_ID AND T.WORKER_TITLE in ('Manager')", con=mydb)
s

  FIRST_NAME WORKER_TITLE
0     Monika      Manager
1      Vivek      Manager

##### Q-25. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [178]:
#Basically, the number of different WORKER_TITLE with similar AFFECTED_FROM date/data
Ans25 = pd.read_sql("select WORKER_TITLE, AFFECTED_FROM, COUNT(*) as FREQUENCY from Title group by WORKER_TITLE, AFFECTED_FROM having count(*) > 1;", con=mydb)
Ans25

  WORKER_TITLE AFFECTED_FROM  FREQUENCY
0    Executive    2016-06-11          3
1         Lead    2016-06-11          2

##### Q-26. Write an SQL query to show only odd rows from a table.

In [181]:
# 'MOD (WORKER_REF_ID, 2) <> 0' simply means worker_ref_id divided by 2 is not equal to zero. 'MOD' is used to retrieve the
# remainder of division inside the bracket while <> means not equal to.

Ans26 = pd.read_sql("select * from title where MOD (WORKER_REF_ID, 2) <> 0", con=mydb)
Ans26

   WORKER_REF_ID WORKER_TITLE AFFECTED_FROM
0              1      Manager    2016-02-20
1              5      Manager    2016-06-11
2              7    Executive    2016-06-11
3              3         Lead    2016-06-11

##### Q-27. Write an SQL query to show only even rows from a table.

In [183]:
Ans27 = pd.read_sql("select * from title where MOD (WORKER_REF_ID, 2) = 0", con=mydb)
Ans27

   WORKER_REF_ID   WORKER_TITLE AFFECTED_FROM
0              2      Executive    2016-06-11
1              8      Executive    2016-06-11
2              4  Asst. Manager    2016-06-11
3              6           Lead    2016-06-11

##### Q-28. Write an SQL query to clone a new table from another table.

In [192]:
# I first need to declare the clone variable name before performing this task.

##### Q-29. Write an SQL query to fetch intersecting records of two tables.

In [ ]:
Ans29 = pd.read_sql("SELECT * FROM Worker INTERSECT SELECT * FROM title;", con=mydb)

##### Q-30. Write an SQL query to show records from one table that another table does not have.

In [ ]:
Ans30 = pd.read_sql("(Select * from worker) MINUS (select * from title);", con=mydb)
Ans30

# The above query won't run because to use MINUS function, the tables must have the same 
# number of columns and the data types must match.

##### Q-31. Write an SQL query to show the current date and time.

In [212]:
# for mysql,
Ans31 = pd.read_sql("select NOW();", con=mydb)
Ans31

                NOW()
0 2021-10-30 10:19:52

##### Q-32. Write an SQL query to show the top n (say 10) records of a table.

In [19]:
Ans32 = pd.read_sql("SELECT * FROM Worker ORDER BY Salary DESC LIMIT 10;", con=mydb)
Ans32

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
1          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          6      Vipul     Diwan  200000 2014-06-11 09:00:00    Account
4          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
5          8    Geetika   Chauhan   90000 2014-04-11 09:00:00      Admin
6          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
7          7     Satish     Kumar   75000 2014-01-20 09:00:00    Account

##### Q-33. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [251]:
Ans33 = pd.read_sql("SELECT Salary FROM Worker ORDER BY Salary DESC LIMIT 5;", con=mydb)
Ans33

   Salary
0  500000
1  500000
2  300000
3  200000
4  100000

##### Q-34. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

In [252]:
Ans34 = pd.read_sql("SELECT Salary FROM Worker W1 WHERE 4 = (SELECT COUNT( DISTINCT ( W2.Salary ) ) FROM Worker W2 WHERE W2.Salary >= W1.Salary);", con=mydb)
Ans34

   Salary
0  100000

##### Q-35. Write an SQL query to fetch the list of employees with the same salary.

In [253]:
Ans35 = pd.read_sql("Select distinct W.WORKER_ID, W.FIRST_NAME, W.Salary from Worker W, Worker W1 where W.Salary = W1.Salary and W.WORKER_ID != W1.WORKER_ID;", con=mydb)
Ans35

   WORKER_ID FIRST_NAME  Salary
0          5      Vivek  500000
1          4    Amitabh  500000

##### Q-36. Write an SQL query to show the second highest salary from a table.

In [255]:
Ans36 = pd.read_sql("Select max(Salary) as second_highest from Worker where Salary not in (Select max(Salary) from Worker);", con=mydb)
Ans36

   second_highest
0          300000

In [ ]:
select * from title t where t.WORKER_TITLE = 'Manager' union all select * from title t1 where t1.WORKER_TITLE = 'manager'

##### Q-37. Write an SQL query to show one row twice in results from a table.

In [257]:
Ans37 = pd.read_sql(" select * from title t where t.WORKER_TITLE = 'Manager' union all select * from title t1 where t1.WORKER_TITLE = 'manager';", con=mydb)
Ans37

   WORKER_REF_ID WORKER_TITLE AFFECTED_FROM
0              1      Manager    2016-02-20
1              5      Manager    2016-06-11
2              1      Manager    2016-02-20
3              5      Manager    2016-06-11

##### Q-38. Write an SQL query to fetch intersecting records of two tables

In [ ]:
# Answer previously given

##### Q-39. Write an SQL query to fetch the first 50% records from a table.

In [20]:
Ans39 = pd.read_sql("select * from worker where WORKER_ID <= (SELECT count(WORKER_ID)/2 from Worker);", con=mydb)
Ans39

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin

##### Q-40. Write an SQL query to fetch the departments that have less than five people in it..

In [21]:
Ans40 = pd.read_sql("Select DEPARTMENT, count(worker_id) as number_of_workers from worker where department < 5 group by department;", con=mydb)
Ans40

  DEPARTMENT  number_of_workers
0         HR                  2
1      Admin                  4
2    Account                  2

In [22]:
# Alternatively,
p = pd.read_sql("SELECT DEPARTMENT, COUNT(WORKER_ID) as 'Number of Workers' FROM Worker GROUP BY DEPARTMENT HAVING COUNT(WORKER_ID) < 5;", con=mydb)
p

  DEPARTMENT  Number of Workers
0         HR                  2
1      Admin                  4
2    Account                  2

##### Q-41. Write an SQL query to show all departments along with the number of people in there.

In [23]:
Ans41 = pd.read_sql("select department, count(department) as number_of_workers from worker group by department;", con=mydb)
Ans41

  department  number_of_workers
0         HR                  2
1      Admin                  4
2    Account                  2

##### Q-42. Write an SQL query to show the last record from a table.

In [24]:
Ans42 = pd.read_sql("Select * from title order by WORKER_REF_ID desc limit 1;", con=mydb)
Ans42

   WORKER_REF_ID WORKER_TITLE AFFECTED_FROM
0              8    Executive    2016-06-11

In [271]:
# alternatively,
w = pd.read_sql("Select * from title where WORKER_REF_ID = (SELECT max(WORKER_ID) from Worker);", con=mydb)
w

   WORKER_REF_ID WORKER_TITLE AFFECTED_FROM
0              8    Executive    2016-06-11

##### Q-43. Write an SQL query to fetch the first row of a table.

In [273]:
Ans43 = pd.read_sql("Select * from title limit 1;", con=mydb)
Ans43

   WORKER_REF_ID WORKER_TITLE AFFECTED_FROM
0              1      Manager    2016-02-20

##### Q-44. Write an SQL query to fetch the last five records from a table

In [25]:
Ans44 = pd.read_sql("SELECT * FROM Worker WHERE WORKER_ID <=5 UNION SELECT * FROM (SELECT * FROM Worker W order by W.WORKER_ID DESC) AS W1 WHERE W1.WORKER_ID <=5;", con=mydb)
Ans44

   WORKER_ID FIRST_NAME LAST_NAME  SALARY        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          2   Niharika     Verma   80000 2014-06-11 09:00:00      Admin
2          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
3          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin
4          5      Vivek     Bhati  500000 2014-06-11 09:00:00      Admin

##### Q-45. Write an SQL query to print the name of employees having the highest salary in each department.

In [26]:
Ans45 = pd.read_sql("SELECT t.DEPARTMENT,t.FIRST_NAME,t.Salary from(SELECT max(Salary) as TotalSalary,DEPARTMENT from Worker group by DEPARTMENT) as TempNew Inner Join Worker t on TempNew.DEPARTMENT=t.DEPARTMENT and TempNew.TotalSalary=t.Salary;", con=mydb)
Ans45

  DEPARTMENT FIRST_NAME  Salary
0         HR     Vishal  300000
1      Admin    Amitabh  500000
2      Admin      Vivek  500000
3    Account      Vipul  200000

##### Q-46. Write an SQL query to fetch three max salaries from a table.

In [27]:
Ans46 = pd.read_sql("SELECT distinct Salary from worker a WHERE 3 >= (SELECT count(distinct Salary) from worker b WHERE a.Salary <= b.Salary) order by a.Salary desc;", con=mydb)
Ans46

   Salary
0  500000
1  300000
2  200000

##### Q-47. Write an SQL query to fetch three min salaries from a table.

In [28]:
Ans47 = pd.read_sql("SELECT distinct Salary from worker a WHERE 3 >= (SELECT count(distinct Salary) from worker b WHERE a.Salary >= b.Salary) order by a.Salary desc;", con=mydb)
Ans47

   Salary
0   90000
1   80000
2   75000

##### Q-48. Write an SQL query to fetch nth max salaries from a table

In [30]:
# n=2
Ans48 = pd.read_sql("SELECT distinct Salary from worker a WHERE 2 >= (SELECT count(distinct Salary) from worker b WHERE a.Salary <= b.Salary) order by a.Salary desc;", con=mydb)
Ans48

   Salary
0  500000
1  300000

##### Q-49. Write an SQL query to fetch departments along with the total salaries paid for each of them

In [31]:
Ans49 = pd.read_sql("SELECT DEPARTMENT, sum(Salary) from worker group by DEPARTMENT;", con=mydb)
Ans49

  DEPARTMENT  sum(Salary)
0         HR     400000.0
1      Admin    1170000.0
2    Account     275000.0

##### Q-50. Write an SQL query to fetch the names of workers who earn the highest salary.

In [32]:
Ans50 = pd.read_sql("SELECT concat(FIRST_NAME,' ',LAST_NAME) as NAME, SALARY from Worker WHERE SALARY=(SELECT max(SALARY) from Worker);", con=mydb)
Ans50

            NAME  SALARY
0  Amitabh Singh  500000
1    Vivek Bhati  500000

**Massive credit to [TechBeamers](https://www.techbeamers.com/) for the sql questions. These solutions were given by me, Edeh Emeka N.**